/* ========================================================================= */
/*   OnlyLCD1602a.ino                                                        */
/*   (c) 2023-12-12 Труфанов Владимир                                        */
/*                                                                           */
/*   Description:          проверка подключения дисплея LCD1602a в различных */
/*                                       версиях Arduino IDE: 1.8.18 и 2.2.1 */
/* ========================================================================= */

// Подключаем штатную библиотеку LiquidCrystal.h
#include <LiquidCrystal.h>
// Создаем объект дисплея на заданных контактах
//               [RS, E, D4, D5, D6, D7] 
LiquidCrystal lcd (3, 4,  5,  6,  7,  8);   

int temperature;
int humidityErr;
String messa;

void setup()
{
   // Инициируем дисплей на 16 столбцов и 2 строки (LCD 16x2)
   lcd.begin(16,2);  
    
   lcd.setCursor(0,0);             // установили курсор на первую строку
   lcd.print("Hello, world");      // вывели текст
   lcd.setCursor(0,1);             // установили курсор на вторую строку
   lcd.print("www.ittve.me");      // вывели текст
}

void loop()
{
}
