/* ========================================================================= */
/*                                                                           */
/*   MemoryGuide.ino                                                         */
/*   (c) 2023-12-13 Труфанов Владимир                                        */
/*                                                                           */
/*   Description:                                                            */
/*   https://docs.arduino.cc/learn/programming/memory-guide                  */
/* ========================================================================= */
