/* ========================================================================= */
/*                                                                           */
/*   AnalogSensor.ino                                                        */
/*   (c) 2023-12-16 Труфанов Владимир                                        */
/*                                                                           */
/*   Description:         примеры работы с аналоговыми датчиками температуры */
/*       (температуры и влажности) на Arduino UNO, Arduino Nano 33 BLE Sense */
/* ========================================================================= */

